Autodesk.Revit.DB.SweptBlend.TopProfile
The curves which make up the top profile of the sketch.
Remarks: The indices of the curves in this array match the indices used in the vertex connection map.

Autodesk.Revit.DB.SweptBlend.BottomProfile
The curves which make up the bottom profile of the sketch.
Remarks: The indices of the curves in this array match the indices used in the vertex connection map.

Autodesk.Revit.DB.SweptBlend.SetVertexConnectionMap(Autodesk.Revit.DB.VertexIndexPairArray)
Sets the mapping between the vertices in the top and bottom profiles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"vertexMap"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input argument-"vertexMap"-is empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the document failed to regenerate.

Autodesk.Revit.DB.SweptBlend.GetVertexConnectionMap
Gets the mapping between the vertices in the top and bottom profiles.
Remarks: Each vertex refers to the start point of the curve from the top and bottom profiles.

Autodesk.Revit.DB.SweptBlend.SelectedPath
The selected curve used for the swept blend path.
Remarks: If the swept blend is based on a sketched path, this property is null.

Autodesk.Revit.DB.SweptBlend.PathSketch
The sketched path for the swept blend.
Remarks: If the swept blend is based on selected 3d curve, this property is null.

Autodesk.Revit.DB.SweptBlend.BottomProfileSymbol
The bottom family symbol profile of the swept blend.
Remarks: If the bottom profile is sketch-based, this property is null.

Autodesk.Revit.DB.SweptBlend.BottomSketch
The bottom profile sketch of the swept blend.
Remarks: If the bottom profile is based on a family symbol, this property is null.

Autodesk.Revit.DB.SweptBlend.TopProfileSymbol
The top family symbol profile of the swept blend.
Remarks: If the top profile is sketch-based, this property is null.

Autodesk.Revit.DB.SweptBlend.TopSketch
The top profile sketch of the swept blend.
Remarks: If the top profile is based on a family symbol, this property is null.

Autodesk.Revit.DB.SweptBlend
A swept blend solid or void form.